; domain
(define (domain p2)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))    
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l6_p6_c6_g6_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate medicine crate6)
	(person-at person1 loc2)
	(person-at person2 loc6)
	(person-at person3 loc3)
	(person-at person4 loc6)
	(person-at person5 loc3)
	(person-at person6 loc5)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person2 food)
	(has-content-person person3 food)
	(has-content-person person4 food)
	(has-content-person person4 medicine)
	(has-content-person person5 food)
	(has-content-person person6 food)
))
)

; plan
1. (put-crate-in-carrier crate6 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate6 depot)
   added: (crate-at-space crate6 carrier1 space4)
   goals met: 1 of 7
2. (put-crate-in-carrier crate5 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate5 depot)
   added: (crate-at-space crate5 carrier1 space3)
   goals met: 1 of 7
3. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 0 of 7
4. (pick-and-drop crate6 loc6 drone1 carrier1 space4 person4 medicine)
   deleted: (crate-at-space crate6 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person4 medicine)
   goals met: 1 of 7
5. (pick-and-drop crate5 loc6 drone1 carrier1 space3 person2 food)
   deleted: (crate-at-space crate5 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person2 food)
   goals met: 2 of 7
6. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 7
7. (put-crate-in-carrier crate4 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate4 depot)
   added: (crate-at-space crate4 carrier1 space4)
   goals met: 3 of 7
8. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 2 of 7
9. (pick-and-drop crate4 loc6 drone1 carrier1 space4 person4 food)
   deleted: (crate-at-space crate4 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person4 food)
   goals met: 3 of 7
10. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 7
11. (put-crate-in-carrier crate3 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate3 depot)
   added: (crate-at-space crate3 carrier1 space4)
   goals met: 4 of 7
12. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 3 of 7
13. (pick-and-drop crate3 loc5 drone1 carrier1 space4 person6 food)
   deleted: (crate-at-space crate3 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person6 food)
   goals met: 4 of 7
14. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 7
15. (put-crate-in-carrier crate2 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space4)
   goals met: 5 of 7
16. (put-crate-in-carrier crate1 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space3)
   goals met: 5 of 7
17. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 4 of 7
18. (pick-and-drop crate1 loc3 drone1 carrier1 space3 person3 food)
   deleted: (crate-at-space crate1 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person3 food)
   goals met: 5 of 7
19. (pick-and-drop crate2 loc3 drone1 carrier1 space4 person5 food)
   deleted: (crate-at-space crate2 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person5 food)
   goals met: 6 of 7
20. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 7 of 7
